status_icons = {
        "pending": "🕐",
        "approved": "✅",
        "rejected": "❌",
        "cancelled": "🚫"
    }


type_names = {
    "day_off": "🏠 Отгул",
    "remote": "💻 Удалёнка",
    "vacation": "🌴 Отпуск",
    "sick_leave": "🏥 Больничный",
    "partial_absence": "⏰ Частичное отсутствие"
}


months = {
    1: "Январь", 2: "Февраль", 3: "Март", 4: "Апрель",
    5: "Май", 6: "Июнь", 7: "Июль", 8: "Август",
    9: "Сентябрь", 10: "Октябрь", 11: "Ноябрь", 12: "Декабрь"
}

days = ["Пн", "Вт", "Ср", "Чт", "Пт", "Сб", "Вс"]

roles = {
        "user": "👤 Пользователь",
        "admin": "👑 Администратор",
        "superuser": "🔱 Супер пользователь",
    }


class CommonMessages:
    """Общие сообщения."""

    ERROR = "❌ Произошла ошибка. Попробуй позже."


class StartMessages:
    """Сообщения для /start."""

    WELCOME_BACK = "С возвращением, {name}! 👋"
    WELCOME_ADMIN = "С возвращением, администратор {name}! 👑"
    HELLO_ANONYMOUS = "Привет! 👋\nВведи свой рабочий email:"


class RegisterMessages:
    """Сообщения регистрации."""

    EMAIL_NOT_FOUND = "❌ Сотрудник с таким email не найден."
    ENTER_CODE = "Отлично! Теперь введи инвайт-код:"

    INVALID_CODE_FORMAT = (
        "❌ Некорректный формат кода.\n\n"
        "Пример:\n"
        "<code>550e8400-e29b-41d4-a716-446655440000</code>"
    )
    CODE_NOT_FOUND = "❌ Код не найден или не предназначен для тебя."
    CODE_ALREADY_USED = "❌ Этот инвайт-код уже был использован."
    CODE_EXPIRED = (
        "⏰ Срок действия кода истёк {expires}.\n"
        "Обратись к администратору за новым кодом."
    )

    SUCCESS = "✅ Регистрация успешна!\nРоль: <b>{role}</b>"


class RoleNames:
    """Названия ролей."""

    ADMIN = "администратор"
    USER = "сотрудник"

    @classmethod
    def get(cls, role: str) -> str:
        if role in ("admin", "superuser"):
            return cls.ADMIN
        return cls.USER
